{
  "_instrucciones": "Este archivo es una plantilla para que una IA genere métodos. Elimina este campo '_instrucciones' en el JSON final.",
  "_reglas": [
    "El campo 'titulo' es OBLIGATORIO - Debe ser descriptivo y claro",
    "El campo 'pasosPrincipales' es OBLIGATORIO - Mínimo 1 paso, máximo recomendado 15 pasos",
    "El campo 'descripcion' es OPCIONAL pero muy recomendado - Breve resumen del método",
    "El campo 'imagenUrl' es OPCIONAL - URL de una imagen representativa (se mostrará en la tarjeta)",
    "El campo 'pasosPrevios' es OPCIONAL - Usar solo si hay preparaciones necesarias antes de comenzar",
    "El campo 'notas' es OPCIONAL - Usar para advertencias importantes, consejos o información adicional",
    "El campo 'etiquetas' es OPCIONAL - Array de palabras clave para búsqueda (3-6 etiquetas recomendado)",
    "El campo 'activo' es OPCIONAL - Usar true si el método funciona actualmente, false si ya no funciona (por defecto es true)",
    "Usa **texto** para resaltar palabras importantes en negrita",
    "Las URLs se convierten automáticamente en enlaces clickeables",
    "Puedes usar emojis (⚠️ ✅ 🔗 💡 📌 etc.) para hacer el contenido más visual",
    "Escribe en un tono claro, directo y fácil de seguir",
    "Cada paso debe ser una acción concreta y específica"
  ],
  "titulo": "Título descriptivo del método (ej: Cómo obtener Spotify Premium por 1€)",
  "descripcion": "Descripción breve y clara de qué trata el método y qué se consigue al final",
  "imagenUrl": "https://ejemplo.com/imagen.jpg",
  "activo": true,
  "pasosPrevios": [
    "Primer requisito o preparación necesaria antes de comenzar",
    "Segundo requisito (usa **negritas** para resaltar lo importante)",
    "Tercer requisito con enlace si es necesario: https://ejemplo.com"
  ],
  "pasosPrincipales": [
    "**Primer paso principal** con acción clara y concreta",
    "Segundo paso con detalles específicos y enlaces si son necesarios",
    "Tercer paso explicando qué hacer exactamente",
    "Cuarto paso (agrega tantos pasos como sean necesarios)"
  ],
  "notas": "⚠️ IMPORTANTE: Coloca aquí advertencias, consejos o información adicional relevante. Usa emojis para resaltar información importante.",
  "etiquetas": ["etiqueta1", "etiqueta2", "etiqueta3", "palabras-clave", "para-buscar"]
}

